elements={"Гідроген":1,
          "Гелій":2,
          "Літій":3,
          "Берилій":4,
          "Бор":5,
          "Вуглець":6,
          "Нітроген":7,
          "Оксиген":8,
          "Флуор":9,
          "Неон":10
}
atomic_mass={"Гідроген": 1.008,
    "Гелій": 4.003,
    "Літій": 6.94,
    "Берилій": 9.012,
    "Бор": 10.81,
    "Вуглець": 12.01,
    "Нітроген": 14.01,
    "Оксиген": 16.00,
    "Флуор": 19.00,
    "Неон": 20.18
}
print("Всі елементи таблиці Менделєєва у словнику:")
for keys in elements:
    print(keys, "-номер:", elements[keys], "маса:", atomic_mass[keys])

name=input("\n Введіть назву елемента:")    

if name in elements:
    print("Елемент:", name)
    print("Порядковий номер:", elements[name])
    print("Відносна атомна маса:", atomic_mass[name])
else:
    print("Такого елемента немає у словнику.")